{
  "id": "522f8055-2f2a-4dda-ab03-4ee318419e6b",
  "title": "Maine and New Hampshire Legislators Urge Kittery Trading Post to Take Action on Gun Violence",
  "path": "maine-new-hampshire-legislators-kittery-trading-post",
  "date": "2018/06/29",
  "description": "Three Maine State Representatives, along with Seven New Hampshire State Representatives and a NH State Senator today urged the Kittery Trading Post (KTP) in Kittery, Maine, to take proactive actions in support of gun violence prevention.",
  "content": "Kittery, Maine / Portsmouth, New Hampshire – Three Maine State Representatives, along with Seven New Hampshire State Representatives and a NH State Senator today urged the Kittery Trading Post (KTP) in Kittery, Maine, to take proactive actions in support of gun violence prevention. In a letter submitted to the management they suggest that the KTP should follow the lead of Walmart and Dick's Sporting Goods by refusing to sell assault-style weapons, increasing background checks, and not selling weapons to customers under the age of 21 years. The letter refers to the good will and positive impression that most Seacoast area customers have had about the KTP, and express disappointment with the lack of response by the store management to the overwhelming support for better gun safety measures. The formal letter was submitted after many office-holders and regular customers had already voiced their support for such measures, without even receiving a response from management.\r\n\r\nA press conference will be held at the Kittery Town Hall, 200 Roger's Rd, on Monday, July 2, 2018 at 10 AM, at which time the supporters of the letter will explain their reasons for this action.\r\n\r\nThe signers of the letter are: Maine Representatives Deane Rykerson, Lydia Blume and Patty Hymanson, while New Hampshire is represented by State Senator Martha Fuller-Clark, Representatives Peter Somssich, Tamara Le, Gerry Ward, Laura Pantelakos, Becky McBeath, Pamela Gordon and Jacqueline Cali-Pitts."
}
